Revit 2024 API
Document.Export Method (String, String, ViewSet, FBXExportOptions)
Exports the document in 3D-Studio Max (FBX) format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Export(
	string folder,
	string name,
	ViewSet views,
	FBXExportOptions options
)
Visual Basic
Public Function Export ( _
	folder As String, _
	name As String, _
	views As ViewSet, _
	options As FBXExportOptions _
) As Boolean
Visual C++
public:
bool Export(
	String^ folder,
	String^ name,
	ViewSet^ views,
	FBXExportOptions^ options
)
Parameters
folder
Type: System.String
Output folder, into which file(s) will be exported. The folder must exist.
name
Type: System.String
Either the name of a single file or a prefix for a set of files. If null or empty, automatic naming will be used.
views
Type: Autodesk.Revit.DB.ViewSet
Selection of views to be exported.Only 3D views are allowed.
options
Type: Autodesk.Revit.DB.FBXExportOptions
Options applicable to the FBX format.
Return Value
Function returns true only if all specified views are exported successfully. The function returns False if exporting of any view fails, even if some views might have been exported successfully.
Remarks
Though the 'options' argument is not currently used, an object still must be provided (may be null).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input views is null
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the input views is an empty ViewSet. Thrown if any view in the views is not a 3D view.
See Also
Document Class
Export Overload
Autodesk.Revit.DB Namespace